// splice & slice
// splice ลบข้อมูลเป็นช่วง
// splice(ตำแหน่งที่จะลบ,จำนวนที่จะลบ,สมาชิกที่แทรกเข้าไปในตำแหน่งที่ลบ)
// มีผลกระทบกับข้อมูล
let data = [0,10,20,30,40,50,60,70,80,90];
data.splice(0,2,999);
console.log(data);

data = [0,10,20,30,40,50,60,70,80,90];

//slice ดึงสมาชิกจาก array มาใช้งาน
//slice (ตำแหน่งเริ่มต้น,ตำแหน่งสุดท้าย-1)
// ไม่มีผลกระทบกับข้อมูล
// สร้างตัวแปรมารับข้อมูล
let result = data.slice(0,5);      // 0 10 20 30 40
console.log(result);       //index // 0  1  2  3  4  5 
